# Pandas Training Book

### Why I made this notebook?

This Notebook is here to train the Pandas Library. 
It contains quizzles for all fundamental Pandas attributes, methods and more. 
The goal is to **master the mechanics through repetition**. 
The work here is based on the book "Python Data Science Handbook" written by Jack VanderPlas, which I really enjoyed reading.

### Requirements

You should know the theory behind numpy and have an understanding why the following tasks work.
This book is just about knowing how to use the code.

### Let's get started

#### Task 1 Installation

1.1 Import Pandas

In [1]:
import pandas as pd

In [2]:
#enter solution

1.2 Show Pandas version

In [3]:
pd.__version__

'1.0.3'

In [4]:
#enter solution

1.3 Import the other library, that panda works with

In [5]:
import numpy as np

In [6]:
#enter solution

#### Task 2 Introducing Pandas Objects

2.1 Create a pandas series with the values 1, 2 , 3 , 4 and save it in the variable **data**

In [7]:
data = pd.Series([1, 2, 3, 4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
#enter solution

2.2 Get the values from the **data** object

In [9]:
data.values

array([1, 2, 3, 4], dtype=int64)

In [10]:
#enter solution

2.3 Show the index-range from the **data** object

In [11]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
#enter solution

2.4 Get the second item from the **data** object

In [13]:
data[1]

2

In [14]:
#enter solution

2.5 Get the values from index 1 to 2

In [15]:
data[1:3]

1    2
2    3
dtype: int64

In [16]:
#enter solution

2.6 create a pandas series with the values 1, 2, 3, 4 and indices a, b, c, d and save it in the varibale **data**

In [17]:
data = pd.Series([1,2,3,4], index=["a", "b", "c", "d"])
data

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
#enter solution

2.7 Get the item for the index "b"

In [19]:
data["b"]

2

In [20]:
#enter solution

2.8 Create a dictionary with the keys "Person1", "Person2", "Person3", "Person4" and the values, 12 ,13 ,15 ,11
save it as **person_dict**. Create a pandas series out of this dictionary and save it as **person_pd**.

In [21]:
person_dict = {"Person1": 12, "Person2": 13, "Person3": 15, "Person4": 11}
print(person_dict)
person_pd = pd.Series(person_dict)
person_pd

{'Person1': 12, 'Person2': 13, 'Person3': 15, 'Person4': 11}

Person1    12
Person2    13
Person3    15
Person4    11
dtype: int64

In [22]:
#enter solution

2.9 Get the values for Person3

In [23]:
person_pd["Person3"]

15

In [24]:
#enter solution

2.10 Get the values from Person2 to Person4

In [25]:
person_pd["Person2":"Person4"]

Person2    13
Person3    15
Person4    11
dtype: int64

In [26]:
#enter solution

2.11 Get a pandas series from the following dictionary with only index 3 and 2

In [27]:
test_dict = {2: "a", 3: "c", 1: "a"}

data = pd.Series(test_dict, index= [3,2])
data

3    c
2    a
dtype: object

In [28]:
#enter solution

#### Task 3 Pandas DataFrame Object

3.1 Create two dictionaries named person_number_dict and person_wage dict with the keys "Person1", "Person2", "Person3", "Person4". 
The values for person_number_dict: 123 , 124 , 125 , 126
The values for person_wage_dict: 10000, 12000 , 9000, 5000

In [29]:
person_number_dict = {"Person1": 123, "Person2": 124, "Person3": 125, "Person4": 126}
person_wage_dict = {"Person1": 10000, "Person2": 12000, "Person3": 9000, "Person4": 5000}

In [30]:
#enter solution

3.2 Create two pandas series with the dictionaries before. Named person_number_pd and person_wage_pd.

In [31]:
person_number_pd = pd.Series(person_number_dict)
person_wage_pd = pd.Series(person_wage_dict)

In [32]:
#enter solution

3.3 Create a data frame with the index set as "Person1", "Person2" ... etc. and the column named as "per. number" and "wage". Fill in the pandas series from before. Save it in the variable **data**

In [33]:
data = pd.DataFrame({"per. number": person_number_pd, "wage": person_wage_pd})
print(data)

         per. number   wage
Person1          123  10000
Person2          124  12000
Person3          125   9000
Person4          126   5000

In [34]:
#enter solution

3.4 Get the indices from the **data** set

In [35]:
data.index

Index(['Person1', 'Person2', 'Person3', 'Person4'], dtype='object')

In [36]:
#enter solution

3.5 Get the column names from the **data** set

In [37]:
data.columns

Index(['per. number', 'wage'], dtype='object')

In [38]:
#enter solution

3.6 Get the column for "wage" from the **data** set

In [39]:
data["wage"]

Person1    10000
Person2    12000
Person3     9000
Person4     5000
Name: wage, dtype: int64

In [40]:
#enter solution

#### Task 4 Create Panda DataFrames

4.1 Create a Panda DataFrame from **person_wage_pd**

In [41]:
data = pd.DataFrame(person_wage_pd, columns= ["wage"])
data

          wage
Person1  10000
Person2  12000
Person3   9000
Person4   5000

In [42]:
#enter solution

4.2 Create a Panda DataFrame from the given dictionary

In [43]:
x_dict = [{"a":i ,"b":i*2 , "c": i**3} for i in range(3)]

pd.DataFrame(x_dict)

   a  b  c
0  0  0  0
1  1  2  1
2  2  4  8

In [44]:
x_dict = [{"a":i ,"b":i*2 , "c": i**3} for i in range(3)]

#enter solution

4.3 Create a Panda DataFrame from the two following dictionaries

In [45]:
x_dict = {"a": 1, "b": 2}
y_dict = {"b": 4, "c": 3}

x_pd = pd.DataFrame([x_dict, y_dict])
x_pd

     a  b    c
0  1.0  2  NaN
1  NaN  4  3.0

In [46]:
x_dict = {"a": 1, "b": 2}
y_dict = {"b": 4, "c": 3}

#enter solution

4.4 Create a Panda DataFrame from the following Numpy array and lists

In [47]:
np.random.seed(42)
np_data = np.random.rand(3,2)
cols = ["foo", "bar"]
ind = ["a", "b", "c"]

pd.DataFrame(np_data, columns=cols, index= ind)

        foo       bar
a  0.374540  0.950714
b  0.731994  0.598658
c  0.156019  0.155995

In [48]:
np.random.seed(42)
np_data = np.random.rand(3,2)
cols = ["foo", "bar"]
ind = ["a", "b", "c"]

#enter solution

4.5 Get the intersection of the follwing two indices

In [49]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [50]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

#enter solution

4.6 Get the union of **indA** and **indB**

In [51]:
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [52]:
#enter solution

4.7 Get the symmetric difference of **indA** and **indB**

In [53]:
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

In [54]:
#enter solution

#### Task 5 Data Indexing and Selection 

5.1 Add 1.25 as index "e" to the Series below

In [55]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index= ["a", "b", "c", "d"])
data["e"] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [56]:
#enter solution

5.2 Get all data between 0.3 and 0.8 from **data**

In [57]:
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [58]:
#enter solution

5.3 Get the explicit index 1 from the following data set

In [59]:
data = pd.DataFrame(["a", "b", "c", "d", "e"], index= [1,2,3,4,5],columns= ["First"])
print(data)
data.loc[1]

  First
1     a
2     b
3     c
4     d
5     e

First    a
Name: 1, dtype: object

In [60]:
data = pd.DataFrame(["a", "b", "c", "d", "e"], index= [1,2,3,4,5],columns= ["First"])

#enter solution

5.4 Get the implicit index 1 from **data**

In [61]:
data.iloc[1]

First    b
Name: 2, dtype: object

In [62]:
#enter solution

5.5 Add a column "Yearly wage" with the wages x12 for the following dataset.

In [63]:
person_wage_dict = {"Person1": 10000, "Person2": 12000, "Person3": 7000, "Person4":5000}
person_number_dict = {"Person1": 123, "Person2": 124, "Person3": 125, "Person4": 126}
person_wage_pd = pd.Series(person_wage_dict)
person_number_pd = pd.Series(person_number_dict)
data = pd.DataFrame({"Person Number": person_number_pd,"Person wage": person_wage_pd})
print(data)

data["Yearly wage"] = data["Person wage"] * 12
data

         Person Number  Person wage
Person1            123        10000
Person2            124        12000
Person3            125         7000
Person4            126         5000

         Person Number  Person wage  Yearly wage
Person1            123        10000       120000
Person2            124        12000       144000
Person3            125         7000        84000
Person4            126         5000        60000

In [64]:
person_wage_dict = {"Person1": 10000, "Person2": 12000, "Person3": 7000, "Person4":5000}
person_number_dict = {"Person1": 123, "Person2": 124, "Person3": 125, "Person4": 126}
person_wage_pd = pd.Series(person_wage_dict)
person_number_pd = pd.Series(person_number_dict)
data = pd.DataFrame({"Person Number": person_number_pd,"Person wage": person_wage_pd})

#enter solution

5.6 Get the values from **data** as a NumPy array

In [65]:
data.values

array([[  123, 10000],
       [  124, 12000],
       [  125,  7000],
       [  126,  5000]], dtype=int64)

In [66]:
#enter solution

5.7 Transpose **data**

In [67]:
data.T

               Person1  Person2  Person3  Person4
Person Number      123      124      125      126
Person wage      10000    12000     7000     5000

In [68]:
#enter solution

5.8 Get the second row from **data** as a NumPy array

In [69]:
data.values[1]

array([  124, 12000], dtype=int64)

In [70]:
#enter solution

5.9 Get the column for ***Person wage*** from **data**

In [71]:
data["Person wage"]

Person1    10000
Person2    12000
Person3     7000
Person4     5000
Name: Person wage, dtype: int64

In [72]:
#enter solution

5.10 Get the implicit indices for the first three rows and first two columns from **data**

In [73]:
data.iloc[:3, :2]

         Person Number  Person wage
Person1            123        10000
Person2            124        12000
Person3            125         7000

In [74]:
#enter solution

5.11 Get the data for Person1 to Person3 and the columns Person number and Person wage from **data**

In [75]:
data.loc[:"Person3", : "Person wage"]

         Person Number  Person wage
Person1            123        10000
Person2            124        12000
Person3            125         7000

In [76]:
#enter solution

#### Task 6 Operations in Pandas

6.1 Add the following Series together and fill the missing values in A or B with 0

In [79]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])

A.add(B, fill_value= 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [80]:
#enter solution

6.2 Add the following Series together and replace missing values in **A** with the mean of **A.stack()**

In [102]:
A = pd.DataFrame(np.random.randint(0,20, (2,2)),columns=list("AB"))
B = pd.DataFrame(np.random.randint(0,10, (3,3)),columns=list("BAC"))
print(A)
print(B)
fill = A.stack().mean()
print(A.add(B, fill_value=fill))

    A   B
0  14   8
1  19  16
   B  A  C
0  0  9  3
1  6  1  2
2  0  4  0
       A      B      C
0  23.00   8.00  17.25
1  20.00  22.00  16.25
2  18.25  14.25  14.25

In [ ]:
#enter solution

6.3 Substract **B** from **A** (use Pandas operator and Pandas method)

In [107]:
A - B
A.sub(B)

      A     B   C
0   5.0   8.0 NaN
1  18.0  10.0 NaN
2   NaN   NaN NaN

In [108]:
#enter solution

6.4 Multiply **A** with **B** (use Pandas operator and Pandas method)

In [109]:
A * B
A.mul(B)

       A     B   C
0  126.0   0.0 NaN
1   19.0  96.0 NaN
2    NaN   NaN NaN

In [110]:
#enter solution

6.5 Divide **A** by **B** (use Pandas operator and Pandas method)

In [116]:
A / B
A.div(B)

           A         B   C
0   1.555556       inf NaN
1  19.000000  2.666667 NaN
2        NaN       NaN NaN

In [117]:
#enter solution

6.6 Get the modulus of **A** divided by **B** (use Pandas operator and Pandas method)

In [119]:
A % B
A.mod(B)

     A    B   C
0  5.0  NaN NaN
1  0.0  4.0 NaN
2  NaN  NaN NaN

In [120]:
#enter solution

6.7 Get **A** to the power of **B** (use Pandas operator and Pandas method)

In [123]:
A ** B
A.pow(B)

              A           B    C
0  2.066105e+10         1.0  NaN
1  1.900000e+01  16777216.0  NaN
2           NaN         1.0  1.0

In [124]:
#enter solution

#### Task 7 Handling missing data

7.1 Get the sum of the following array

In [128]:
data = np.array([1, np.nan, 3, 4])

np.nansum(data)

8.0

In [129]:
data = np.array([1, np.nan, 3, 4])

#enter solution

7.2 Get the minimum from **data**

In [130]:
np.nanmin(data)

1.0

In [131]:
#enter solution

7.3 Get the maximum from **data**

In [132]:
np.nanmax(data)

4.0

In [133]:
#enter solution

7.4 Check which elements are Null values in the following Series

In [134]:
data = pd.Series([1, np.nan, "hello", None])

data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [135]:
#enter solution

7.5 Get the elements in a new Series whithout Null values

In [142]:
data[data.isnull() == False]
#or
data[data.notnull()]
#or
data.dropna()

0        1
2    hello
dtype: object

In [139]:
#enter solution

7.6 Drop the elements that are Null values from the following DataFrame

In [144]:
data = pd.DataFrame([[1, np.nan, 2 ],
                     [2, 3 ,5 ],
                     [np.nan, 4, 6 ]])
print(data)
data.dropna()

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

     0    1  2
1  2.0  3.0  5

In [145]:
#enter solution

7.7 Drop the columns with Null value elements from **data**

In [146]:
data.dropna(axis= "columns")

   2
0  2
1  5
2  6

In [147]:
#enter solution

7.8 Add a column with Null value to **data**

In [149]:
data[3] = np.nan
data

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [150]:
#enter solution

7.9 Drop only the columns where all elements are Null value from **data**

In [151]:
data.dropna(axis= "columns", how= "all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [152]:
#enter solution

7.10 Fill the following Null values with zeros

In [157]:
data = pd.Series([1, np.nan, 2, None, 3], index= list("abcde"))
print(data)
data.fillna(0)

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [158]:
#enter solution

7.11 Forward-fill the missing data with the previous value

In [159]:
data.fillna(method= "ffill")

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [160]:
#enter solution

7.12 Back-fill the missing data with the next value backwards

In [163]:
data.fillna(method= "bfill")

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [ ]:
#enter solution

#### Task 8 Hierachical Indexing

8.1  Set a multi-index with the following list of tuples

In [166]:
index = [("California", 2000), ("California", 2010), ("New York", 2000), 
         ("New York", 2010), ("Texas", 2000), ("Texas", 2010)]

index = pd.MultiIndex.from_tuples(index)
print(index)

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [ ]:
#enter solution

8.2 Create a Series with the following populations and multi-index **index**

In [169]:
populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

pop = pd.Series(populations, index = index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [170]:
#enter solution

8.3 Get the data for all cities in the year 2010 from pop

In [173]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [174]:
#enter solution

8.4 Convert the multi-index **pop** to a simple DataFrame

In [175]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [176]:
#enter solution

8.5 Convert the DataFrame back to a multi-index DataFrame

In [ ]:
#enter solution

In [178]:
pop_df = pop_df.stack()
pop_df

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

8.6 Add the following list as a new column to the **pop_df** and name it "under18", name the first column "total"

In [181]:
under18 = [9267089, 9284094, 4687374, 4318033, 5906301, 6879014]

pop_df = pd.DataFrame({"total": pop, "under18": under18})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [182]:
#enter solution

8.7 Add a third column that shows the fraction in percent numbers of under18 from the total and name it "fu18"

In [191]:
pop_df["fu18"] = (pop_df["under18"] / pop_df["total"]) *100 
pop_df

                    total  under18       fu18
California 2000  33871648  9267089  27.359428
           2010  37253956  9284094  24.921096
New York   2000  18976457  4687374  24.700997
           2010  19378102  4318033  22.283054
Texas      2000  20851820  5906301  28.325110
           2010  25145561  6879014  27.356773

In [192]:
#enter solution

8.8 Create a multi-index from arrays using:
   
    [["a", "a", "b", "b"], [1,2,1,2]]

In [193]:
[["a", "a", "b", "b"], [1,2,1,2]]

pd.MultiIndex.from_arrays([["a", "a", "b", "b"], [1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [194]:
#enter solution

8.9 Create the same multi-index from tuples

In [195]:
pd.MultiIndex.from_tuples([("a",1),("a", 2),("b", 1), ("b",2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [196]:
#enter solution

8.10 Create the same multi-index from a Cartesian product

In [197]:
pd.MultiIndex.from_product([["a", "b"], [1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [ ]:
#enter solution

8.11 Create the same multi-index from using levels and labels

In [212]:
pd.MultiIndex(levels=[["a","b"],[1,2]], codes= [[0,0,1,1], [0,1,0,1]])

# In the book the key-word says "labels" instead "codes". If you read the docstring by putting the command 
# below you can see, that it got updated.
#pd.MultiIndex?

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [211]:
#enter solution

8.12 Set the names attribute for the two indices from **pop_df** "state" and "year"

In [214]:
pop_df.index.names= ["state", "year"]
pop_df

                    total  under18       fu18
state      year
California 2000  33871648  9267089  27.359428
           2010  37253956  9284094  24.921096
New York   2000  18976457  4687374  24.700997
           2010  19378102  4318033  22.283054
Texas      2000  20851820  5906301  28.325110
           2010  25145561  6879014  27.356773

In [215]:
#enter solution

8.13 Set the multi-index for index and columns with the following code provided

In [218]:
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]], names= ["year", "visit"])
columns = pd.MultiIndex.from_product([["Bob", "Guido", "Sue"], ["HR", "Temp"]], names= ["subject", "type"])
data = np.round(np.random.randn(4,6), 1)
data[:,::2] *= 10
data += 37

df = pd.DataFrame(data, index= index, columns= columns)
print(df)

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  36.8  44.0  38.1  19.0  38.2
     2      27.0  35.9   8.0  36.2  37.0  36.6
2014 1      32.0  35.9  46.0  38.0  41.0  35.1
     2      60.0  37.1  42.0  35.5  37.0  37.4

In [219]:
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]], names= ["year", "visit"])
columns = pd.MultiIndex.from_product([["Bob", "Guido", "Sue"], ["HR", "Temp"]], names= ["subject", "type"])
data = np.round(np.random.randn(4,6), 1)
data[:,::2] *= 10
data += 37

#enter solution

8.14 Get the full data for "Guido"

In [220]:
df["Guido"]

type          HR  Temp
year visit
2013 1      44.0  38.1
     2       8.0  36.2
2014 1      46.0  38.0
     2      42.0  35.5

In [234]:
#enter solution

8.15 Get the data for "California" in the year 2000 for **pop**

In [236]:
pop["California", 2000]

33871648

In [237]:
#enter solution

8.16 Get the full data for "California"

In [238]:
pop["California"]

year
2000    33871648
2010    37253956
dtype: int64

In [239]:
#enter solution

8.17 Get the data for "California" to "New York"

In [240]:
pop.loc["California": "New York"]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [241]:
#enter solution

8.18 Get all data for the year 2000

In [242]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [243]:
#enter solution

8.19 Get all data that is over 22'000'000

In [244]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [245]:
#enter solution

8.20 Get the data for "California" and "Texas"

In [ ]:
#enter solution

In [246]:
pop[["California", "Texas"]]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

8.21 Get the data for subject "Bob" and type "HR" from **df**

In [248]:
df["Guido", "HR"]

year  visit
2013  1        44.0
      2         8.0
2014  1        46.0
      2        42.0
Name: (Guido, HR), dtype: float64

In [249]:
#enter solution

8.22 Get the data for the first two rows and first two columns

In [250]:
df.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      46.0  36.8
     2      27.0  35.9

In [251]:
#enter solution

8.23 Get the data for rows: all "years" and only "visit" 2 and columns: all "subjects" and only type "HR"

In [254]:
idx = pd.IndexSlice
df.loc[idx[:,2], idx[:,"HR"]]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 2      27.0   8.0  37.0
2014 2      60.0  42.0  37.0

In [255]:
#enter solution

8.24 Sort the index alphabetically

In [258]:
index = pd.MultiIndex.from_product([["a", "c", "b"], [1,2]])
data = pd.Series(np.random.rand(6), index= index)
data.index.names=["char", "int"]
print(data)
data = data.sort_index()
data

char  int
a     1      0.552820
      2      0.296510
c     1      0.419781
      2      0.256207
b     1      0.611514
      2      0.081594
dtype: float64

char  int
a     1      0.552820
      2      0.296510
b     1      0.611514
      2      0.081594
c     1      0.419781
      2      0.256207
dtype: float64

In [259]:
#enter solution

8.25 Unstack **pop** at the first index level ("state")

In [265]:
print(pop)
pop.unstack(level=0)

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [266]:
#enter solution

8.26 Unstack **pop** at the second index level ("year")

In [267]:
print(pop)
pop.unstack(level=1)

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [268]:
#enter solution

8.27 Reset the index as columns in **pop** and save it in **pop_flat**, name the column with population data "population"

In [273]:
pop_flat = pop.reset_index(name= "population")
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [274]:
#enter solution

8.28 Set the indices back to "state" and "year" in **pop_flat**

In [275]:
pop_flat.set_index(["state", "year"])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [276]:
#enter solution

8.29 Get the mean for the visits in each year for every subject and type.

In [278]:
print(df)
df_mean = df.mean(level="year")
df_mean

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  36.8  44.0  38.1  19.0  38.2
     2      27.0  35.9   8.0  36.2  37.0  36.6
2014 1      32.0  35.9  46.0  38.0  41.0  35.1
     2      60.0  37.1  42.0  35.5  37.0  37.4

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     36.5  36.35  26.0  37.15  28.0  37.40
2014     46.0  36.50  44.0  36.75  39.0  36.25

In [279]:
#enter solution

8.30 Get the mean for all type "HR" and "Temp" in each year

In [280]:
df_mean.mean(axis=1, level="type")

type         HR       Temp
year
2013  30.166667  36.966667
2014  43.000000  36.500000

In [281]:
#enter solution

#### Task 9 Concatenation of NumPy Arrays and Pandas

9.1 Concatenate the following lists horizontally to a NumPy array

In [282]:
x= [1,2,3]
y= [4,5,6]
z= [7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [283]:
x= [1,2,3]
y= [4,5,6]
z= [7,8,9]

#enter solution

9.2 Concatenate the following list of lists with itself horizontally to a NumPy array

In [285]:
x= [[1,2],
   [3,4]]
np.concatenate([x,x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [286]:
x= [[1,2],
   [3,4]]

#enter solution

9.3 Concatenate the two Panda Series

In [287]:
ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [288]:
ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[4,5,6])

#enter solution

9.4 Change the index so ser2 gets added horizontally to ser1

In [293]:
ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[1,2,3])
pd.concat([ser1,ser2], axis=1)

   0  1
1  A  D
2  B  E
3  C  F

In [294]:
#enter solution

ser1 = pd.Series(["A", "B", "C"], index=[1,2,3])
ser2 = pd.Series(["D", "E", "F"], index=[4,5,6])

9.5 Concatenate the two following DataFrames

In [298]:
#function to create a DataFrame quickly
def make_df(cols,ind):
    """Quickly make a DataFrame"""
    data= {c: [str(c) + str(i) for i in ind]
          for c in cols}
    return pd.DataFrame(data,ind)

df1 = make_df("AB", [1,2])
df2 = make_df("AB", [3,4])
print(df1), print(df2) , print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

(None, None, None)

In [322]:
#function to create a DataFrame quickly
def make_df(cols,ind):
    """Quickly make a DataFrame"""
    data= {c: [str(c) + str(i) for i in ind]
          for c in cols}
    return pd.DataFrame(data,ind)

df1 = make_df("AB", [1,2])
df2 = make_df("AB", [3,4])

#enter solution

9.6 Concatenate the two following DataFrames in the same index

In [323]:
df3 = make_df("AB", [0,1])
df4 = make_df("CD", [0,1])
print(df3), print(df4), print(pd.concat([df3,df4], axis= "columns"))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

(None, None, None)

In [324]:
df3 = make_df("AB", [0,1])
df4 = make_df("CD", [0,1])

#enter solution

9.7 Set the index of the following DataFrame **y** to the same index as **x** and concatenate the two together.

In [325]:
x = make_df("AB", [0,1])
y = make_df("AB", [2,3])

y.index = x.index
print(x), print(y), print(pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

(None, None, None)

In [326]:
x = make_df("AB", [0,1])
y = make_df("AB", [2,3])

#enter solution

9.8 Concatenate the previous two df's again, but with the right index

In [332]:
y.index = x.index
pd.concat([x,y], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [328]:
#enter solution

9.9 Concatenate the previous two df's again, but set keys x and y to the index series

In [333]:
pd.concat([x,y], keys=["x", "y"])

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [346]:
#enter solution

9.10 Concatenate the two following df's

In [354]:
df5 = make_df("ABC", [1,2])
df6 = make_df("BCD", [3,4])

print(df5), print(df6), print(pd.concat([df5,df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

(None, None, None)

In [355]:
df5 = make_df("ABC", [1,2])
df6 = make_df("BCD", [3,4])

#enter solution

9.11 Concatenate the columns of the previous two df's that they have in common

In [356]:
pd.concat([df5,df6], join="inner")

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [350]:
#enter solution

9.12 Append **df2** to **df1**

In [376]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [362]:
#enter solution

#### Task 10 Combining Datasets: Merge and Join

10.1  Merge the two following df's

In [383]:
df1 = pd.DataFrame({"employee": ["Bob", "Jake", "Lisa", "Sue"], 
                    "group": ["Accounting", "Engineering", "Engineering", "HR"]})
df2 = pd.DataFrame({"employee": ["Lisa", "Bob", "Jake", "Sue"], "hire_date": [2004,2008,2012,2014]})
print(df1),print(df2)
df3 = df1.merge(df2)
print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [380]:
df1 = pd.DataFrame({"employee": ["Bob", "Jake", "Lisa", "Sue"], 
                    "group": ["Accounting", "Engineering", "Engineering", "HR"]})
df2 = pd.DataFrame({"employee": ["Lisa", "Bob", "Jake", "Sue"], "hire_date": [2004,2008,2012,2014]})

#enter solution

10.2 Merge **df3** with the following df

In [386]:
df4 = pd.DataFrame({"group": ["Accounting", "Engineering", "HR"], "supervisor": ["Carly", "Guido", "Steve"]})
print(df3), print(df4)
df3.merge(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [387]:
df4 = pd.DataFrame({"group": ["Accounting", "Engineering", "HR"], "supervisor": ["Carly", "Guido", "Steve"]})

#enter solution

10.3 Merge **df1** with the following df

In [388]:
df5 = pd.DataFrame({"group": ["Accounting", "Accounting", "Engineering", "Engineering", "HR", "HR"], 
                    "skills": ["math", "spreadsheet", "coding", "linux", "spreadsheet", "organization"]})
df1.merge(df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting   spreadsheet
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR   spreadsheet
7      Sue           HR  organization

In [389]:
df5 = pd.DataFrame({"group": ["Accounting", "Accounting", "Engineering", "Engineering", "HR", "HR"], 
                    "skills": ["math", "spreadsheet", "coding", "linux", "spreadsheet", "organization"]})

#enter solution

10.4 Merge **df1** and **df2** by the column "employee"

In [392]:
print(df1), print(df2)
print(pd.merge(df1,df2, on="employee"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [393]:
#enter solution

10.5 Merge df1 with the following df considering different labels for the same column

In [394]:
df3 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                    "salary": [70000, 80000, 120000, 90000]})
print(df1), print(df3), print(pd.merge(df1,df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

(None, None, None)

In [395]:
df3 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                    "salary": [70000, 80000, 120000, 90000]})

#enter solution

10.6 Merge df1 with df3 considering different labels for the same column and drop the column "name"

In [397]:
pd.merge(df1,df3, left_on= "employee", right_on= "name").drop("name", axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [398]:
#enter solution

10.7 Set the indices from **df1** and **df2** to "employee" and save it as **df1a** and **df2a**

In [399]:
df1a = df1.set_index("employee")
df2a = df2.set_index("employee")

print(df1a), print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

(None, None)

In [401]:
#enter solution

10.8 Merge **df1a** and **df2a** by index

In [404]:
pd.merge(df1a, df2a, left_index=True, right_index=True)
#or
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [405]:
#enter solution

10.9 Merge the following two df's, getting only the intersection of the two df's

In [407]:
df6 = pd.DataFrame({"name": ["Peter", "Paul", "Mary"], 
                    "food": ["fish", "beans", "bread"]}, 
                   columns= ["name", "food"])
df7 = pd.DataFrame({"name": ["Mary", "Joseph"], 
                    "drink": ["wine", "beer"]},
                   columns= ["name", "drink"])
print(df6), print(df7), print(pd.merge(df6,df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

(None, None, None)

In [408]:
df6 = pd.DataFrame({"name": ["Peter", "Paul", "Mary"], 
                    "food": ["fish", "beans", "bread"]}, 
                   columns= ["name", "food"])
df7 = pd.DataFrame({"name": ["Mary", "Joseph"], 
                    "drink": ["wine", "beer"]},
                   columns= ["name", "drink"])

#enter solution

10.10 Merge **df6** and **df7**, getting the union of the two df's

In [409]:
pd.merge(df6,df7, how= "outer")

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [410]:
#enter solution

10.11 Merge **df6** and **df7**, getting only range of df6

In [413]:
pd.merge(df6,df7, how="left")

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [414]:
#enter solution

10.11 Merge **df6** and **df7**, getting only range of df7

In [415]:
pd.merge(df6,df7, how="right")

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [416]:
#enter solution

10.12 Merge the following df's, getting both data for the same column name

In [417]:
df8 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                   "rank": [1,2,3,4]})
df9 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"],
                   "rank": [3,1,4,2]})

print(df8), print(df9), print(pd.merge(df8,df9, on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

(None, None, None)

In [418]:
df8 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], 
                   "rank": [1,2,3,4]})
df9 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"],
                   "rank": [3,1,4,2]})

#enter solution

10.13 Merge **df8** and **df9**, getting both data for the same column name and change the suffix to _L and _R

In [419]:
pd.merge(df8,df9, on="name", suffixes= ["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [420]:
#enter solution

#### Task 11 Example: US States Data

11.1